---
kind: property
id: P:Autodesk.Revit.DB.Electrical.PanelScheduleData.IsHeaderSectionHidden
source: html/e2e39d21-7934-f3eb-3a69-54d308b10971.htm
---
# Autodesk.Revit.DB.Electrical.PanelScheduleData.IsHeaderSectionHidden Property

True if the user wishes to hide the header section; setting this value must go through the appropriate update function

## Syntax (C#)
```csharp
public bool IsHeaderSectionHidden { get; }
```